<?php

declare(strict_types=1);

namespace SergeyZatulivetrov\TinkoffAcquiring\Constants;

class Error
{
    const ERROR_7    = "Покупатель не найден";
    const ERROR_53   = "Обратитесь к продавцу";
    const ERROR_99   = "Попробуйте повторить попытку позже";
    const ERROR_100  = "Повторите попытку позже";
    const ERROR_101  = "Не пройдена идентификация 3DS";
    const ERROR_102  = "Операция отклонена, пожалуйста обратитесь в интернет-магазин или воспользуйтесь другой картой";
    const ERROR_103  = "Повторите попытку позже";
    const ERROR_1006 = "Проверьте реквизиты или воспользуйтесь другой картой";
    const ERROR_1012 = "Попробуйте повторить попытку позже";
    const ERROR_1013 = "Повторите попытку позже";
    const ERROR_1014 = "Неверно введены реквизиты карты. Проверьте корректность введенных данных";
    const ERROR_1030 = "Повторите попытку позже";
    const ERROR_1033 = "Проверьте реквизиты или воспользуйтесь другой картой";
    const ERROR_1034 = "Попробуйте повторить попытку позже";
    const ERROR_1041 = "Попробуйте повторить попытку позже";
    const ERROR_1043 = "Попробуйте повторить попытку позже";
    const ERROR_1051 = "Недостаточно средств на карте";
    const ERROR_1054 = "Проверьте реквизиты или воспользуйтесь другой картой";
    const ERROR_1057 = "Попробуйте повторить попытку позже";
    const ERROR_1065 = "Попробуйте повторить попытку позже";
    const ERROR_1082 = "Проверьте реквизиты или воспользуйтесь другой картой";
    const ERROR_1089 = "Попробуйте повторить попытку позже";
    const ERROR_1091 = "Попробуйте повторить попытку позже";
    const ERROR_1096 = "Повторите попытку позже";
    const ERROR_9999 = "Внутренняя ошибка системы";
}
